#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/benoit/diag/runs/run-Re7LG2SnHbVXuw74

Waiting for the plan to start...

Terraform v1.1.2
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_iam_user.github: Refreshing state... [id=github]
aws_ecr_repository.diag: Refreshing state... [id=diag]
aws_iam_group.github: Refreshing state... [id=github]
aws_iam_group_membership.github: Refreshing state... [id=github]
aws_iam_policy.ecr_access: Refreshing state... [id=arn:aws:iam::144149190966:policy/ecr_access]
aws_iam_group_policy_attachment.ecr_access: Refreshing state... [id=github-20220103010142630700000001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_group.kops will be created
  + resource "aws_iam_group" "kops" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "kops"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # aws_iam_group_membership.kops will be created
  + resource "aws_iam_group_membership" "kops" {
      + group = "kops"
      + id    = (known after apply)
      + name  = "kops"
      + users = [
          + "kops",
        ]
    }

  # aws_iam_group_policy_attachment.aws_config_attach["arn:aws:iam::aws:policy/AmazonEC2FullAccess"] will be created
  + resource "aws_iam_group_policy_attachment" "aws_config_attach" {
      + group      = "kops"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2FullAccess"
    }

  # aws_iam_group_policy_attachment.aws_config_attach["arn:aws:iam::aws:policy/AmazonEventBridgeFullAccess"] will be created
  + resource "aws_iam_group_policy_attachment" "aws_config_attach" {
      + group      = "kops"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEventBridgeFullAccess"
    }

  # aws_iam_group_policy_attachment.aws_config_attach["arn:aws:iam::aws:policy/AmazonRoute53FullAccess"] will be created
  + resource "aws_iam_group_policy_attachment" "aws_config_attach" {
      + group      = "kops"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonRoute53FullAccess"
    }

  # aws_iam_group_policy_attachment.aws_config_attach["arn:aws:iam::aws:policy/AmazonS3FullAccess"] will be created
  + resource "aws_iam_group_policy_attachment" "aws_config_attach" {
      + group      = "kops"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonS3FullAccess"
    }

  # aws_iam_group_policy_attachment.aws_config_attach["arn:aws:iam::aws:policy/AmazonSQSFullAccess"] will be created
  + resource "aws_iam_group_policy_attachment" "aws_config_attach" {
      + group      = "kops"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSQSFullAccess"
    }

  # aws_iam_group_policy_attachment.aws_config_attach["arn:aws:iam::aws:policy/AmazonVPCFullAccess"] will be created
  + resource "aws_iam_group_policy_attachment" "aws_config_attach" {
      + group      = "kops"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonVPCFullAccess"
    }

  # aws_iam_group_policy_attachment.aws_config_attach["arn:aws:iam::aws:policy/IAMFullAccess"] will be created
  + resource "aws_iam_group_policy_attachment" "aws_config_attach" {
      + group      = "kops"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/IAMFullAccess"
    }

  # aws_iam_user.kops will be created
  + resource "aws_iam_user" "kops" {
      + arn           = (known after apply)
      + force_destroy = false
      + id            = (known after apply)
      + name          = "kops"
      + path          = "/"
      + unique_id     = (known after apply)
    }

  # aws_s3_bucket.kops will be created
  + resource "aws_s3_bucket" "kops" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "bjbjb-org-com"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + server_side_encryption_configuration {
          + rule {
              + apply_server_side_encryption_by_default {
                  + sse_algorithm = "AES256"
                }
            }
        }

      + versioning {
          + enabled    = true
          + mfa_delete = false
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_SECRET_ACCESS_KEY"
│ but a value was found in file "/terraform/terraform.tfvars". If you meant
│ to use this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "AWS_ACCESS_KEY_ID" but a
│ value was found in file "/terraform/terraform.tfvars". If you meant to use
│ this value, add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵

```
</details>
*Pusher: @bbourbie, Action: `pull_request`*